import Modal from '@mui/material/Modal'
import { usePrivacyModal } from '../../store/helperModal'
import { Box, Link } from '@mui/material'

const PrivacyRulesModal = () => {
	const open = usePrivacyModal((state) => state.open)
	const toggleOpen = usePrivacyModal((state) => state.toggleOpen)

	return (
		<Modal open={open} onClose={toggleOpen}>
			<Box
				sx={{
					display: 'flex',
					flexDirection: 'column',
					alignItems: 'left',
					justifyContent: 'flex-start',
					padding: '50px',
					backgroundColor: '#fff',
					borderRadius: '0.3125em',
					boxShadow: '0 2px 4px rgba(0, 0, 0, 0.2)',
					position: 'fixed',
					top: '50%',
					left: '50%',
					transform: 'translate(-50%, -50%)',
					overflowY: 'scroll',
					maxHeight: '95vh',
				}}
			>
				<h3 style={{ textAlign: 'center' }}>Политика за поверителност</h3>

				<p>
					Вашата поверителност е важна за нас. Настоящата политика за поверителност описва
					как събираме, използваме, разкриваме и защитаваме вашата информация, когато
					посещавате нашия уебсайт [име на уебсайта] (наричан по-долу "Уебсайт").
				</p>

				<h5>1. Събиране на информация</h5>
				<p>
					Ние събираме информация, когато влизате в нашия Уебсайт, правите поръчки или се
					абонирате за нашия бюлетин. Информацията, която можем да съберем, включва:
				</p>
				<ul>
					<li>
						Лични данни: име, адрес, имейл, телефонен номер и информация за плащане.
					</li>
					<li>
						Нелични данни: информация за браузъра, IP адреса, времето на достъп и
						страниците, които посещавате.
					</li>
				</ul>

				<h5>2. Използване на информацията</h5>
				<p>Ние използваме събраната информация за следните цели:</p>
				<ul>
					<li>Обработка на поръчки и управление на вашия акаунт.</li>
					<li>Комуникация с вас относно вашите поръчки и запитвания.</li>
					<li>Подобряване на нашите услуги и Уебсайт.</li>
					<li>Изпращане на маркетингови съобщения, ако сте се абонирали за тях.</li>
				</ul>

				<h5>3. Разкриване на информацията</h5>
				<p>
					Ние не продаваме, не търгуваме и не предаваме вашата лична информация на трети
					страни, освен в следните случаи:
				</p>
				<ul>
					<li>
						На доставчици на услуги, които ни помагат в управлението на нашия Уебсайт и
						обработката на поръчките.
					</li>
					<li>Когато е необходимо да спазим закона или да защитим нашите права.</li>
				</ul>

				<h5>4. Защита на информацията</h5>
				<p>
					Ние прилагаме подходящи мерки за сигурност, за да защитим вашата информация от
					неразрешен достъп, разкриване или унищожаване. Въпреки това, моля, имайте
					предвид, че нито един метод на предаване по интернет или електронно съхранение
					не е 100% сигурен.
				</p>

				<h5>5. Вашите права</h5>
				<p>Имате право да:</p>
				<ul>
					<li>Искате достъп до вашата лична информация.</li>
					<li>Искате корекция на неточна информация.</li>
					<li>Искате изтриване на вашата информация, когато не е необходима.</li>
					<li>Оттеглите съгласието си за обработка на лични данни.</li>
				</ul>

				<h5>6. Промени в политиката за поверителност</h5>
				<p>
					Ние си запазваме правото да актуализираме настоящата политика за поверителност.
					Всички промени ще бъдат публикувани на тази страница с актуализирана дата на
					влизане в сила.
				</p>

				<h5>7. Контактна информация</h5>
				<p>
					Ако имате въпроси относно нашата политика за поверителност, моля, свържете се с
					нас на:
				</p>
				<ul>
					<li>
						<Link
							href={`mailto:knigibg@gmail.com`}
							sx={{
								paddingLeft: '5px',
								color: 'var(--heading-color)',
								':hover': {
									hover: 'white',
								},
							}}
							defaultValue='knigibg@gmail.com'
						>
							knigibg@gmail.com
						</Link>
					</li>
					<li>
						<Link
							href={`tel:0888 888 888`}
							sx={{
								paddingLeft: '5px',
								color: 'var(--heading-color)',
								':hover': {
									hover: 'white',
								},
							}}
							defaultValue='0888 888 888'
						>
							0888 888 888
						</Link>
					</li>
					<li>София, България</li>
				</ul>
			</Box>
		</Modal>
	)
}

export default PrivacyRulesModal
